{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables defining color themes and shared UI styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the ValentinePage.",
  "frontend/src/components/CustomDomainSection.tsx": "Form-driven component that collects a domain and canister ID and generates DNS setup instructions.",
  "frontend/src/components/FloatingHeartsOverlay.tsx": "Renders multiple animated floating heart emojis for decorative overlay.",
  "frontend/src/components/PersonalMomentEffect.tsx": "Trigger-based visual effect overlay with sparkles and heart burst animations.",
  "frontend/src/components/PhotoGallery.tsx": "Three-image gallery component displaying themed photos.",
  "frontend/src/components/ShareLinkButton.tsx": "Button that copies the current page URL to the clipboard and shows temporary confirmation.",
  "frontend/src/components/ValentinePage.tsx": "Main page composing audio, animations, gallery, proposal flow, sharing, and custom domain navigation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider managing Internet Identity authentication, loading stored identities, and exposing login/clear functions with status flags.",
  "frontend/src/index.css": "Tailwind-based global styles defining a romantic theme, custom components, animations, and light/dark CSS variables.",
  "frontend/src/lib/runtimeUrl.ts": "Returns the current browser URL for share/copy functionality.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project metadata tracking features, domain setup plans, and state versioning."
}